src/Documents/НачислениеОплатыПоОкладу.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>НачислениеОплатыПоОкладу</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>CalculationRegister.Зарплата</xr:Item>
				<xr:Item>AccountingRegister.Управленческий</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЗаМесяц</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Сотрудники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/AccountingRegisters/Управленческий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccountingRegister>
		<Properties>
			<Name>Управленческий</Name>
			<ChartOfAccounts>ChartOfAccounts.Управленческий</ChartOfAccounts>
			<Correspondence>true</Correspondence>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Количественный</v8:TypeSet>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Управленческий.AccountingFlag.Количественный</AccountingFlag>
				</Properties>
			</Resource>
		</ChildObjects>
	</AccountingRegister>
</MetaDataObject>

src/CalculationRegisters/Зарплата.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<CalculationRegister>
		<Properties>
			<Name>Зарплата</Name>
			<Periodicity>Month</Periodicity>
			<ActionPeriod>true</ActionPeriod>
			<BasePeriod>true</BasePeriod>
			<Schedule>InformationRegister.Календарь</Schedule>
			<ScheduleValue>InformationRegister.Календарь.Resource.РабочийДень</ScheduleValue>
			<ScheduleDate>InformationRegister.Календарь.Dimension.День</ScheduleDate>
			<ChartOfCalculationTypes>ChartOfCalculationTypes.Начисления</ChartOfCalculationTypes>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
					<BaseDimension>false</BaseDimension>
				</Properties>
			</Dimension>
		</ChildObjects>
	</CalculationRegister>
</MetaDataObject>

src/Documents/НачислениеОплатыПоОкладу/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.Управленческий.Очистить();
	Движения.Зарплата.Очистить();
	Движения.Управленческий.Записывать = Истина;
	Движения.Зарплата.Записывать = Истина;
	
	Для Каждого Строка Из Сотрудники Цикл
		Движение = Движения.Зарплата.Добавить();
		Движение.ПериодРегистрации = Дата;
		Движение.ПериодДействияНачало = НачалоМесяца(ЗаМесяц);
		Движение.ПериодДействияКонец = КонецМесяца(ЗаМесяц);
		Движение.ВидРасчета = ПланыВидовРасчета.Начисления.ОплатаПоОкладу;
		Движение.Сотрудник = Строка.Сотрудник;
	КонецЦикла;
	
	Движения.Зарплата.Записать();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
					|	Сотрудники.Ссылка КАК Сотрудник,
					|	Сотрудники.Оклад КАК Оклад
					|ПОМЕСТИТЬ ВТ_ОкладДокумент
					|ИЗ
					|	Документ.НачислениеОплатыПоОкладу.Сотрудники КАК НачислениеОплатыПоОкладуСотрудники
					|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Сотрудники КАК Сотрудники
					|		ПО НачислениеОплатыПоОкладуСотрудники.Сотрудник = Сотрудники.Ссылка
					|ГДЕ
					|	НачислениеОплатыПоОкладуСотрудники.Ссылка = &Ссылка
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////
					|ВЫБРАТЬ
					|	ВТ_ОкладДокумент.Сотрудник КАК Сотрудник,
					|	ВТ_ОкладДокумент.Оклад КАК Оклад,
					|	ЗарплатаДанныеГрафика.НомерСтроки КАК НомерСтроки,
					|	ЕСТЬNULL(ЗарплатаДанныеГрафика.РабочийДеньПериодДействия, 0) КАК План,
					|	ЕСТЬNULL(ЗарплатаДанныеГрафика.РабочийДеньФактическийПериодДействия, 0) КАК Факт,
					|	ЗарплатаДанныеГрафика.ВидРасчета КАК ВидРасчета
					|ИЗ
					|	ВТ_ОкладДокумент КАК ВТ_ОкладДокумент
					|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.Зарплата.ДанныеГрафика(ВидРасчета = &Оклад) КАК ЗарплатаДанныеГрафика
					|		ПО ВТ_ОкладДокумент.Сотрудник = ЗарплатаДанныеГрафика.Сотрудник
					|ГДЕ
					|	ЗарплатаДанныеГрафика.ПериодДействияНачало = &ПериодДействияНачало
					|	И ЗарплатаДанныеГрафика.ПериодДействияКонец = &ПериодДействияКонец"; 
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Оклад", ПланыВидовРасчета.Начисления.ОплатаПоОкладу);
	Запрос.УстановитьПараметр("ПериодДействияНачало", НачалоМесяца(ЗаМесяц));
	Запрос.УстановитьПараметр("ПериодДействияКонец", КонецМесяца(ЗаМесяц));
	
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если Не ЗначениеЗаполнено(Выборка.Факт) Или Не ЗначениеЗаполнено(Выборка.План) Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Отсутствуют данные графика";
			Сообщение.Сообщить();
			Отказ = Истина;
		Иначе
			Движение = Движения.Зарплата[Выборка.НомерСтроки - 1];
			Движение.Сумма = Выборка.Оклад * Выборка.Факт / Выборка.План;
			
			Проводка = Движения.Управленческий.Добавить();
			Проводка.Период = Дата;
			Проводка.СчетДт = ПланыСчетов.Управленческий.Расходы;
			Проводка.СчетКт = ПланыСчетов.Управленческий.РасчетыССотрудниками;
			Проводка.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.Сотрудники] = Выборка.Сотрудник;
			Проводка.Сумма = Движение.Сумма;
		КонецЕсли;	
	КонецЦикла;
		
	
КонецПроцедуры
